const lessonsData = [
  {
    name: "📗 درس دهم - ازدواج و پاسخ به نیازها",
    content:
      "کدام نوع رابطه، عمیق‌ترین و صمیمی‌ترین تجربه ارتباطی در زندگی افراد است؟\nرابطه‌ای اختصاصی در سطح اول با جنس مخالف که در قالب ازدواج شکل می‌گیرد، صمیمی‌ترین و مؤثرترین رابطه در زندگی فرد است.\n\nجوان‌ها در دوره بلوغ تا زمان ازدواج چه نوع مواجهه‌ای با مسئله ازدواج دارند؟\nبرخی به دلیل مشغله‌ها یا اهداف بزرگ، نیاز به جنس مخالف را در اولویت پایین قرار می‌دهند. اما گروهی دیگر با بروز احساس نیاز، به دنبال پاسخ‌گویی به آن هستند. اغلب افراد در بین این دو حالت نوسان دارند.\n\nافرادی که به‌صورت جدی با کشش‌های جنسی روبه‌رو هستند، چه راه‌هایی برای پاسخ به آن در پیش می‌گیرند؟\nراه‌هایی مانند: 1- ازدواج در اولین فرصت 2- عقد طولانی‌مدت 3- نامزدی با صیغه محرمیت 4- نشان کردن\n\nچه مزایایی در ازدواج در اولین فرصت وجود دارد؟\nپاسخ صفحه 55 قسمت سبزرنگ\n\nچالش‌های ازدواج در اولین فرصت چیست؟\nنبود پختگی، شرایط سخت اقتصادی و تحصیلی، احتمال پشیمانی در آینده به دلیل انتخاب ناپخته.\n\nچه شرایطی برای موفقیت در ازدواج زودهنگام لازم است؟\nپختگی فردی – آمادگی برای زندگی با قناعت – حمایت والدین – شناخت معیارهای همسر مناسب.\n\nمزایای عقد طولانی‌مدت چیست؟\nپاسخ صفحه 57 قسمت سبزرنگ\n\nچه چالش‌هایی در عقد طولانی‌مدت وجود دارد؟\nتعارض بین زوج و خانواده‌ها، فشار دوگانه به دختر، احتمال دخالت زیاد والدین، و خطر بارداری ناخواسته.",
  },

  {
    name: "📘 درس یازدهم - نامزدی و نشان کردن",
    content:
      "1- ............. رابطه اختصاصی میان یک دختر و یک پسر است که تحت اشراف خانواده ها همراه با .......... رخ می دهد و برای دایره محدودی از اطرافیان علنی است\nپاسخ: نامزدی - صیغه محرمیت\n\n2-مزایای نامزدی با صیغه محرمیت را بنویسید\nپاسخ: قسمت سبز رنگ صفحه 60\n\n3-معمولا نامزدی ........... به دنبال دارد که شناخت حاصل از این دوران را تحت تاثیر قرار می دهد\nپاسخ: دلبستگی\n\n4- برای نامزدی به افرادی میتوان اطمینان کرد که ..........در مدیریت رفتار و ........... را نشان داده باشند\nپاسخ: پختگی لازم - خویشتن داری\n\n5-وقتی دختر و پسر با همراهی خانواده ها یکدیگر را برای ازدواج انتخاب کردند ولی شرایط عقد و ازدواج برایشان مهیا نیست ، خانواده ها دو طرف را برای هم ............ میکنند\nپاسخ: نشان\n\n6-مزایای نشان کردن را بنویسید\nپاسخ: قسمت سبزرنگ صفحه 62\n\n7-یکی از مهم ترین چالش های نشان کردن.....................است که به آن ها اجازه ی برطرف کردن نیازهای ..........و ........... را نمی دهد\nپاسخ: محدود بودن ارتباط دو طرف - عاطفی - جنسی\n\n8- در ............ رفت و آمد به شکل زن و شوهر رخ نمی دهد\nپاسخ: نشان کردن",
  },

  {
    name: "📙 درس دوازدهم - پختگی عقل",
    content:
      "1-شاخص های پختگی عقل را نام ببرید\nپاسخ: تصمیم گیری سنجیده / مشورت گرفتن / پند پذیری / انتقاد پذیری / مسئولیت پذیری\n\n2-........... زمینه ی تحقیر و شکننده شدن روابط فرد را فراهم میکند\nپاسخ: ناپختگی\n\n3-بسیاری از مشکلاتی که یک نوجوان در ارتباط با اعضای خانواده خود دارد، نا از همین..............ها است\nپاسخ: ناپختگی\n\n4-...........، توانایی تشخیص و انتخاب مسیر درست زندگی به جای راه های غلط و تشخیص و انتخاب خوب به جای بد است\nپاسخ: عقل\n\n5-برخی مواقع با اینکه میدانیم کاری درست نیست، ولی چون به دنبال ......... و .......... و ......... خودمان هستیم، از راه حق دوری میکنیم\nپاسخ: میل / لذت / راحتی\n\n6-منظور از حق، سخن و رفتار مطابق با ........ و.............و............. است\nپاسخ: واقعیت/فطرت/شرع\n\n7-این جمله از کیست؟ عقل جز با پیروی از حق، کامل نمیشود\nپاسخ: امام حسین (ع)\n\n8-قدرت تصمیم گیری یعنی چه؟\nپاسخ: یعنی اینکه فرد بتواند در مراحل مختلف زندگی، گزینه های مختلف را بررسی و بدون تزلزل و وابستگی، بهترین را نسبت به شرایط خود انتخاب کند\n\n9-تصمیم گیری یک مهارت است و بیش از هرچیز به ........... و ............... نیاز دارد.\nپاسخ: جرئت/سنجیده عمل کردن\n\n10-تکانشی بودن یعنی چه؟\nپاسخ: یعنی اینکه شما در اثر کوچک ترین حادثه ای بدون فکر و براساس احساس خود عمل کنید\n\n11- بهترین پشتیبان انسان برای تشخیص درست از غلط در کارها مشورت با افراد ........ و ........ و ......... است\nپاسخ: آگاه/با تجربه/قابل اعتماد\n\n12- این جمله از کیست؟ کسی که مشورت نکند، پشیمان میشود\nپاسخ: امیرالمومنین (ع)\n\n13- نپذیرفتن پند، انتقاد یا مشورت دیگران، از سر لجاجت و سرسختی نشانه ای از .......... و.............فرد است\nپاسخ: حقارت/ضعف\n\n14- این جمله از کیست؟ محبوب ترین دوستان من کسی است که عیب هایم را به من هدیه دهد\nپاسخ: امام صادق (ع)\n\n15- این جمله از کیست؟ مومن، آینه ی مومن است\nپاسخ: پیامبر (ص)\n\n16- احساس مسئولیت. یک .............. است که انسان را وادار میکند کارهایی را که پذیرفته است، به بهترین شکل انجام دهد\nپاسخ: احساس درونی",
  },

  {
    name: "📕 درس سیزدهم - پختگی اجتماعی",
    content:
      "1- شاخص های پختگی اجتماعی را نام ببرید\nپاسخ: حفظ احترام دیگران/تشکر و قدر دانی/دوری از توقعات بیجا/مدیریت رفتار در هیجانات/حساسیت اجتماعی/حفظ اسرار خود و دیگران/غیرت و مردانگی/خوش برخوردی در عین واقعیت/صلابت و توانایی اداره زندگی/شوخی مناسب\n\n2- بلوغ اجتماعی را تعریف کنید\nپاسخ: بلوغ اجتماعی یعنی اینکه نه تنها به خود و خواسته های خود اهمیت می دهید، بلکه خواسته های دیگران نیز برایتان مهم است\n\n3- بعضی افراد به بهانه پختگی، ژست پیری و بزرگسالی به خود میگیرند که این خود نشانه ........... آنها است\nپاسخ: خامی\n\n4- محور و اساس پختگی اجتماعی ........ و رعایت ......... است\nپاسخ: ادب/آداب\n\n5-ادب یعنی شما حد و مرز و اندازه را در ....... و ...... و ........ با دیگران رعایت کنید\nپاسخ: گفتار/رفتار/تعامل\n\n6- آداب آن بخش از قواعد و ضوابط رفتاری است که در ........ و ........... و ......... وجود دارد\nپاسخ: فرهنگ/عرف/دین\n\n7- فردی که عزت نفس بالایی دارد مراقب است که با ............. به دیگران، ...........خودش را نیز حفظ کند\nپاسخ: احترام گذاشتن/حرمت\n\n8- این جمله از کیست؟ کسی که بابت زحمات دیگران تشکر نمیکند، مشابه راهزنی است که خیر و نیکی را از مردم می دزدد، چرا که دیگران را از انجام کار خیر پشیمان می کند\nپاسخ: امام صادق (ع)\n\n9-توان مدیریتی پسر ها در مدیریت کشش ها، یکی از نشانه های ............ است\nپاسخ: بلوغ اجتماعی\n\n10-..........یعنی تحمل داشته و عکس العملتان را در بهترین وقت بروز دهید\nپاسخ: بردباری\n\n11- کمک به اصلاح رفتار دیگران یا همان امر به معروف و نهی از منکر مصداقی از .................... موثر است\nپاسخ: حساسیت اجتماعی\n\n12- ........... آن چیزهایی است که باید در دل پنهان بماند یا حداکثر به اشخاص مخصوصی گفته شود\nپاسخ: اسرار\n\n13- بیان ناراحتی ها به کسی که نمیتواند کمکتان کند، شخصیتتان را ......... میکند\nپاسخ: کم ارزش",
  },

  {
    name: "📔 درس چهاردهم - غیرت و مقتدر بودن",
    content:
      "مقتدر کسی است که قدرت خود را همراه با ........... و .............. اعمال می کند\nپاسخ: تدبیر/رضایت دیگران\n\nمرد ............ مسئولیت پذیر است و از مردانگی خود به دیگران بهره می رساند، ولی مرد ............. فقط به زورش تکیه دارد و با بداخلاقی زورگویی می کند\nپاسخ: مقتدر/قلدر\n\nپاسداری فرد از حریم تعلقات خودش را ......... می نامیم\nپاسخ: غیرت\n\nمنشا غیرت، .......... و .......... و ........ و ........ در مردان است\nپاسخ: محبت/شجاعت/احساس مسئولیت/اقتدار\n\nبی غیرتی می تواند نشانه این باشد که خود مرد نیز ........... نیست\nپاسخ: پاکدامن\n\nحساسیت بی جا در مورد تعاملات سالم و عفیفانه، نوعی ........ و ............ و ........... است\nپاسخ: تعصب/بی منطقی/ظلم\n\nاین جمله از کیست؟ کسی که با مومنی خوش برخوردی کند بهشت بر او واجب می شود و خوش برخوردی با دشمن ستیزه جو انسان را از عذاب آتش نجات میدهد\nپاسخ: حضرت زهرا (س)\n\nیکی از مهم ترین راز های جذابیت .......... است\nپاسخ: خوش خلقی\n\nاگر ........... کافی نداشته باشید، نمی توانید قاطعیت به خرج دهید\nپاسخ: عزت نفس\n\nبسیاری از پسرها در نوجوانی، تقریبا همه ی مسائل را به شوخی میگذارنند که این حد از شوخی، قطعا نشانه ی ................ است\nپاسخ: ناپختگی اجتماعی\n\nشوخی و مزاح زیاد از حد ........... شما را کاهش داده و .............. شما را زیر سوال می برد\nپاسخ: قدرت تعقل/اعتبار اجتماعی",
  },

  {
    name: "📒 درس پانزدهم - پختگی اقتصادی",
    content:
      "شاخص های پختگی اقتصادی را نام ببرید\nپاسخ: عقل معاش/پرهیز از بیکاری/کسب لقمه حلال/پذیرش مسئولیت مالی خانواده\n\nعقل معاش سه جنبه دارد که شامل............ و ........... و................ است\nپاسخ: کسب درآمد/پس انداز/خرج کردن\n\nاهل کار بودن به این است که فرد حس ............. خود را پرورش داده و از ........... بالایی برخوردار باشد\nپاسخ: استقلال اقتصادی/عزت نفس\n\nمصرف باید بر اساس ....... شکل بگیرد و نه بر اساس ....... .\nپاسخ: نیاز/درآمد\n\n........ یعنی در حد لازم خرج کنیم و زیاده روی نکنیم\nپاسخ: قناعت\n\nزندگی گوارا در ......... است و قانع ........... است\nپاسخ: قناعت/بی نیاز\n\nکسی که ...........کند، فقیر نخواهد شد\nپاسخ: میانه روی\n\nاین جمله از کیست؟ هرکس خود را اجیر کند، از رزق خود جلوگیری کرده است\nپاسخ: امام صادق (ع)\n\nکسب لقمه حلال ........ و .......... یک مرد است\nپاسخ: وظیفه/هنر\n\nموارد زیر را مطابق با توضیحات کتاب مختصرا شرح دهید: غش در معامله، کم فروشی، رشوه و زیرمیزی، ربا، احتکار، مال مخلوط به حرام\nپاسخ: توضیحات صفحه 91 و 92\n\nنفقه چیست؟\nپاسخ: تامین مالی که شامل همه ی نیازمندی هایی است که به صورت متعارف برای یک خانواده و در حد شئونات زن، به تناسب زمان ضروری است و مرد نمی تواند از آن سر باز زند\n\nازدواج شراکت اقتصادی نیست بلکه شراکت ........... است\nپاسخ: شراکت عاطفی",
  },

  {
    name: "📓 درس شانزدهم - پختگی عاطفی",
    content:
      "1-شاخص های پختگی عاطفی را نام ببرید\nپاسخ: رفتار متناسب با احساس دیگران/همدلی کردن/مدیریت ابراز احساسات/مدیریت روابط عاطفی\n\n2-................یعنی فرد عواطف خود و دیگران را درک و مدیریت کند\nپاسخ: پختگی یا بلوغ عاطفی\n\n3- ابراز همدلی یعنی طوری با طرف مقابل صحبت یا رفتار کنید که احساس کند شما او را .............. و .............. را میفهمید\nپاسخ: درک می کنید/احساساتش\n\n4- کسی که مشکلی دارد قبل از هرچیز نیاز دارد کسی او را ......... کند تا اینکه به او ........نشان دهد\nپاسخ: درک/راه حل\n\n5- به هر رابطه ای که در آن سهم قابل توجهی از ..........درگیر شود، رابطه عاطفی می گویند و یکی از نشانه های مهم پختگی عاطفی......... این گونه روابط است\nپاسخ: عاطفه/مدیریت\n\n6- گاهی بین دو هم سن علاقه ی شدید عاطفی برقرار میشود که به ............. معروف است\nپاسخ: دوستی افراطی\n\n7-یکی از دلایل ضربات عاطفی آن است که چیزی را که فرد باید با ..........به دنبال آن باشد، از طریق .............دنبال میکند\nپاسخ: ازدواج/غیر ازدواج",
  },

  {
    name: "📖 درس هفدهم - مهارت‌های زندگی",
    content:
      "1- ................. توانمندی هایی هستند که به افراد کمک میکنند تا با نیاز ها و چالش های زندگی روزمره بهتر کنار بیایند\nپاسخ: مهارت های زندگی\n\n2- محور مهارت ها و آداب پیشگیرانه این است که شما دیگران را .......... و ........... نباشید\nپاسخ: درک کنید/خودخواه\n\n3- شما برای درک بهتر دیگران، نیاز دارید که ............ و .............. داشته باشید\nپاسخ: انعطاف پذیری/مثبت نگری\n\n4- یکی از جنبه های انعطاف پذیری این است که بدانیم همه ی ما ممکن است ........... .\nپاسخ: اشتباه کنیم\n\n5- اگر میخواهید روابط موفق و سازنده داشته باشید، باید بتوانید از میزان ........... بودن خود کم کنید\nپاسخ: خودخواه\n\n6- زندگی مانند منحنی ضربان قلب است، باید فراز و نشیب و پستی و بلندی داشته باشد وگرنه نشانه .......... است\nپاسخ: مرگ\n\n7-فرافکنی یک فرایند ......... است \nپاسخ: دفاعی\n\n8- فرد ............... بسیاری از آسیب ها و ایرادهای دیگران را نادیده می گیرد\nپاسخ: مثبت نگر\n\n9- خوشبختی و رضایت یک اتفاق نیست، بلکه ................ است\nپاسخ: یک انتخاب شخصی",
  },

  {
    name: "📌 درس هجدهم - مهارت حل اختلاف",
    content:
      "1- مهارت حل اختلاف یکی از مهمترین مهارت ها و ................. است\nپاسخ: آداب زندگی\n\n2- نکات مربوط به مهارت های قبل از بروز اختلاف را نام ببرید\nپاسخ: دروغ نگویید/به طور مکرر انتقاد نکنید/توقعات کمتری داشته باشید/به دغدغه های همسرتان توجه کنید\n\n3-نکات مربوط به مهارت های حین بروز اختلاف را نام ببرید\nپاسخ: عناوین 1 تا 10 کتاب صفحات 112 تا 115 (فقط عنوان ها)\n\n4- نکات مربوط به مهارت های بعد از بروز اختلاف را به ترتیب نام ببرید و مورد اول را توضیح دهید\nپاسخ صفحه 115\n\n5- ممکن است خطای دیگران آسیب جدی به زندگی شما بزند، گاهی لازم است اشتباهی از یک دوست را بهانه ای برای قطع یک ........... کنید\nپاسخ: رابطه مخرب\n\n6- اختلاف با خویشاوندان، نباید تحت هیچ شرایطی به قطع ارتباط با آنان منجر شود, زیرا صله رحم ......... است\nپاسخ: واجب",
  },

  {
    name: "🌟 درس نوزدهم - هدف ازدواج",
    content:
      "1- ......... و ............ در مورد موضوعی خاص، عمده ترین عامل برای درنظر گرفتن افراد به عنوان گزینه ازدواج است\nپاسخ: جذابیت فرد/همفکری\n\n2- تصمیم درست وقتی است که شما ابتدا ....................با مجموعه انتخاب کرده باشید\nپاسخ: انگیزه ای هماهنگ\n\n3- در مورد انتخاب همسر مانند هر انتخاب دیگری، اول باید ..............را بشناسید\nپاسخ: هدف ازدواج\n\n4- هدف از ازدواج چیست\nپاسخ: دو خط اولِ زیر تیتر «آرامش، هدف ازدواج» صفحه 119\n\n5- اگر کسی در ازدواج در پی انگیزه ی نادرست باشد، به چه سرنوشتی دچار میشود؟\nپاسخ: نه خود از این ازدواج راضی میشود و نه میتواند نیاز همسر و فرزندانش را پاسخگو باشد\n\n6- انگیزه های ناسازگار با ازدواج را نام ببرید.\nپاسخ: کسب ثروت/موقعیت اجتماعی/خودنمایی و شهرت/زیبایی",
  },

  {
    name: "🎯 درس بیستم - ویژگی‌های همسر",
    content:
      "ویژگی های عمومی زن زندگی که باید برای ازدواج مورد بررسی قرار گیرد را نام ببرید\nپاسخ: بلوغ عقلی/بلوغ عاطفی/بلوغ اجتماعی/اخلاق خوش/حیا/پذیرش مسئولیت های داخل خانه\n\nشاخصه های بلوغ عقلی، عاطفی و اجتماعی در زن زندگی را شرح دهید\nپاسخ: ص 124\n\nبا خیلی از کمبود ها میتوان زندگی را ادامه داد ولی هیچ چیز نمی تواند .............. یک فرد را جبران کند\nپاسخ: بداخلاقی\n\nوظایف داخلی خانه جز وظایف شرعی و قانونی دختر ...........\nپاسخ: نیست",
  },

  {
    name: "💍 درس بیست و یکم - همتایی",
    content:
      "همتایی را تعریف کنید\nپاسخ: دو خط اول ص 130\n\nانواع همتایی را نام ببرید\nپاسخ: همتایی فکری/همتایی اعتقادی/همتایی اقتصادی/همتایی فرهنگی و خانوادگی/همتایی اجتماعی/همتایی سنی/همتایی شخصیتی\n\nکسی که ظاهری متدین دارد لزوما فرد مومنی ..........\nپاسخ: نیست\n\nبه تعبیر امام صادق(ع) ایمان فرد به کثرت نماز و روزه هایش ............\nپاسخ: نیست",
  },
];

function renderLessons(searchTerm = "") {
  const container = document.getElementById("lessonsContainer");
  container.innerHTML = "";
  const term = searchTerm.trim().toLowerCase();

  let filteredLessons = lessonsData;

  if (term !== "") {
    filteredLessons = lessonsData.filter(function (lesson) {
      return (
        lesson.name.toLowerCase().indexOf(term) !== -1 ||
        lesson.content.toLowerCase().indexOf(term) !== -1
      );
    });
  }

  if (filteredLessons.length === 0) {
    container.innerHTML =
      '<div class="no-result">❌ نتیجه‌ای برای "' +
      searchTerm +
      '" پیدا نشد</div>';
    return;
  }

  for (let i = 0; i < filteredLessons.length; i++) {
    let lesson = filteredLessons[i];
    let displayContent = lesson.content;

    if (term !== "") {
      let regex = new RegExp("(" + term + ")", "gi");
      displayContent = displayContent.replace(
        regex,
        '<span class="highlight">$1</span>'
      );
    }

    // تبدیل خطوط به پاراگراف
    displayContent = displayContent.replace(/\n/g, "<br>");

    const lessonDiv = document.createElement("div");
    lessonDiv.className = "lesson-card";
    lessonDiv.innerHTML =
      '<div class="lesson-header"><h2>' +
      lesson.name +
      '</h2></div><div class="lesson-content">' +
      displayContent +
      "</div>";
    container.appendChild(lessonDiv);
  }
}

document.getElementById("searchInput").addEventListener("input", function (e) {
  renderLessons(e.target.value);
});

renderLessons("");
